Python 3.14.0a1 (tags/v3.14.0a1:8cdaca8, Oct 15 2024, 20:08:21) [MSC v.1941 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.

==================== RESTART: C:/Users/86188/Desktop/猜数字.py ====================
欢迎来到猜数字游戏！
我已经想好了一个 1 到 100 之间的整数，你有 10 次机会猜中它。

请输入你的猜测（1-100）: 10
太小了！还剩 9 次机会。

请输入你的猜测（1-100）: 99
太大了！还剩 8 次机会。

请输入你的猜测（1-100）: 66
太大了！还剩 7 次机会。

请输入你的猜测（1-100）: 55
太大了！还剩 6 次机会。

请输入你的猜测（1-100）: 11
太小了！还剩 5 次机会。

请输入你的猜测（1-100）: 36
太小了！还剩 4 次机会。

请输入你的猜测（1-100）: 44
太小了！还剩 3 次机会。

请输入你的猜测（1-100）: 50
太大了！还剩 2 次机会。

请输入你的猜测（1-100）: 49
太大了！还剩 1 次机会。

请输入你的猜测（1-100）: 48
太大了！还剩 0 次机会。

机会用完了，正确答案是 46。下次加油！
>>> 
>>> 
==================== RESTART: C:/Users/86188/Desktop/猜数字.py ====================
欢迎来到猜数字游戏！
我已经想好了一个 1 到 100 之间的整数，你有 10 次机会猜中它。

请输入你的猜测（1-100）: 50
太小了！还剩 9 次机会。

请输入你的猜测（1-100）: 75
太小了！还剩 8 次机会。

请输入你的猜测（1-100）: 90
太大了！还剩 7 次机会。

请输入你的猜测（1-100）: 85
太大了！还剩 6 次机会。

请输入你的猜测（1-100）: 80
太小了！还剩 5 次机会。

请输入你的猜测（1-100）: 83
太大了！还剩 4 次机会。

请输入你的猜测（1-100）: 82
太大了！还剩 3 次机会。

请输入你的猜测（1-100）: 81
恭喜！你用了 8 次猜中了数字 81！
